tap "eth-p/software"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
# Library and utilities for processing GIFs
brew "giflib"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Vector graphics library with cross-device output support
brew "cairo"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Library to render SVG files using Cairo
brew "librsvg"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# Simplistic interactive filtering tool
brew "peco"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@16"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Terraform
brew "hashicorp/tap/terraform"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Multi-platform web browser
cask "microsoft-edge"
# Security software for business
cask "nordlayer"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Window snapping tool
cask "rectangle-pro"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
